Напишите программу, которая в последовательности натуральных десятичных чисел определяет количество элементов, запись которых  
в системе счисления с основанием 7 оканчивается цифрой 1. Если среди входных данных таких элементов нет, программа должна вывести «NO»_.

Программа получает на вход в первой строке натуральное число – количество чисел _N_ (3 ≤ _N_ ≤ 10 000), затем _N_ натуральных чисел,  
не превышающих 30 000, каждое в отдельной строке.

Программа должна вывести одно число – количество десятичных чисел (элементов последовательности), запись которых в 7-ричной системе счисления оканчивается цифрой 1, или «NO»_, если среди входных данных таких элементов нет.

**Стандартный вид**

```python
N = int(input())
переменная для решения задачи
for i in range(N):
	a = int(input())
	if a % 7 == 1: # вариант условия
		#действия с переменной
if переменная > 0:
	print(переменная)
else:
	print("NO")
```

**Оканчивается какой-то цифрой + количество**

```python
N = int(input())
count = 0 # счетчик
for i in range(N):
	a = int(input())
	if a % 7 == 1: # 7 - система счисления, 1 - последняя цифра
		count += 1
if count != 0:
	print(count)
else:
	print("NO")
```

**Оканчивается нечетной цифрой + максимальное** 

```python
N = int(input())
maxim = 0 # тут храним максимальное число
for i in range(N):
	a = int(input())
	if (a % 5) % 2 != 0: # 5 - система счисления
		if a > maxim:
			maxim = a
if maxim != 0:
	print(maxim)
else:
	print("NO")
```

**Оканчивается нечетной цифрой + минимальной** 

```python
N = int(input())
minim = 30001 # тут храним максимальное число
for i in range(N):
	a = int(input())
	if (a % 5) % 2 != 0: # 5 - система счисления
		if a < minim:
			minim = a
if minim != 0:
	print(minim)
else:
	print("NO")
```

**Оканчивается четной цифрой + среднее арифметическое** 
```python
N = int(input())
summa = 0
count = 0 
for i in range(N):
	a = int(input())
	if (a % 5) % 2 == 0: # 5 - система счисления
		summa += a
		count +=1
if count != 0:
	print(summa/count)
else:
	print("NO")
```


**Оканчивается четной цифрой + сумма**

```python
N = int(input())
summa = 0 # счетчик
for i in range(N):
	a = int(input())
	if (a % 5) % 2 == 0: # 5 - система счисленияа
		summa += a
if summa != 0:
	print(summa)
else:
	print("NO")


